package by.htp.les02.start;

public class Task_07 {
// Дан прямоугольник, ширина которого в два раза меньше длинны. Найти площадь прямоугольника.
	public static void main(String[] args) {
		double a; // ширина
		
		double s;
		
		a = 4;

		s = 2 * a * a;
		
		System.out.println ("Площадь прямоугольника " + s);
	}

}
