package by.htp.les02.start;

//	2. Найдите значение функции: с = 3 + а.
public class Task02 {

	public static void main(String[] args) {
		double a;

		double c;

		a = 5.0;
		c = 3 + a;

		System.out.println("Для a = " + a + " значение функции 3 + а = " + c);
	}

}
