package by.htp.les02.start;

public class Task07 {
// 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
	public static void main(String[] args) {
		double x; // ширина

		double rez;

		x = 5.0;

		rez = (x / 2) * x;

		System.out.println("Площадь прямоугольника = " + rez + " кв. ед.");

	}

}
